# Ripasso iniziale

In [1]:
import pandas as pd

datas = {'Nome':['Aldo', 'Giovanni', 'Giacomo'],
         'Età':[10,18,28]}

dataframe = pd.DataFrame(datas)
print(dataframe)

       Nome  Età
0      Aldo   10
1  Giovanni   18
2   Giacomo   28

In [2]:
df_olders = dataframe[dataframe['Età'] > 20]
df_olders

      Nome  Età
2  Giacomo   28

In [3]:
dataframe['Maggiorenne'] = dataframe['Età'] >= 18
dataframe

       Nome  Età  Maggiorenne
0      Aldo   10        False
1  Giovanni   18         True
2   Giacomo   28         True

In [7]:
import numpy as np
datas = {'Nome':['Aldo', 'Giovanni', 'Giacomo', 'Alessandro', 'Aldo'],
         'Età':[10,18,28, np.nan, 10],
         'Città':['Bologna', 'Bologna', 'Bologna', 'Bologna', 'Bologna'] }
df = pd.DataFrame(datas)
df.dropna()

       Nome   Età    Città
0      Aldo  10.0  Bologna
1  Giovanni  18.0  Bologna
2   Giacomo  28.0  Bologna
4      Aldo  10.0  Bologna

In [8]:
df = df.drop_duplicates()
df

         Nome   Età    Città
0        Aldo  10.0  Bologna
1    Giovanni  18.0  Bologna
2     Giacomo  28.0  Bologna
3  Alessandro   NaN  Bologna

# Esercizio 1

In [33]:
import pandas as pd
import numpy as np
import random

names = ['Giuseppe', 'Aldo', 'Alex', 'Marco', 'Mirko', 'Chiara', 'Sara', 'Elisa', 'Giuseppina']
cities = ['Roma', 'Bologna', 'Trento', 'Milano', 'Cosenza', 'Taranto', 'Latina', 'Torino', 'Genova']
n = 2500
ages = np.random.randint(14,50, n)
salaries = np.random.randint(1500, 3500, n)
data_names = [random.choice(names) for _ in range(n)]
data_cities = [random.choice(cities) for _ in range(n)]

In [34]:
datas = {'Nomi': data_names,
         'Città': data_cities,
         'Età': ages,
         'Salario': salaries}

df = pd.DataFrame(datas)

In [35]:
df.head()

         Nomi    Città  Età  Salario
0    Giuseppe     Roma   45     3439
1       Mirko  Cosenza   49     2880
2  Giuseppina   Latina   38     1843
3    Giuseppe   Torino   27     2649
4      Chiara   Torino   26     2043

In [36]:
df.tail()

         Nomi   Città  Età  Salario
245     Elisa  Torino   38     2807
246      Alex    Roma   23     1993
247  Giuseppe  Milano   35     3433
248      Sara  Milano   38     2610
249     Mirko  Milano   44     2689

In [27]:
df.dtypes

Nomi       object
Città      object
Età         int32
Salario     int32
dtype: object

In [37]:
df.describe()

             Età      Salario
count  250.00000   250.000000
mean    31.01600  2579.152000
std      9.88446   562.057252
min     14.00000  1516.000000
25%     22.00000  2147.250000
50%     30.00000  2588.000000
75%     39.00000  3052.500000
max     49.00000  3483.000000

In [38]:
df.drop_duplicates()
df.tail()

         Nomi   Città  Età  Salario
245     Elisa  Torino   38     2807
246      Alex    Roma   23     1993
247  Giuseppe  Milano   35     3433
248      Sara  Milano   38     2610
249     Mirko  Milano   44     2689

In [32]:
df.isnull().sum()

Nomi       0
Città      0
Età        0
Salario    0
dtype: int64